        >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. coboltut. *> change data format
AUTHOR. Yanling.
DATE-WRITTEN.July 6th 2022 
ENVIRONMENT DIVISION.
CONFIGURATION SECTION. 

DATA DIVISION. 
FILE SECTION. 
WORKING-STORAGE SECTION.
01 StartNum PIC 9(8)V99 VALUE 00001123.55.
01 NoZero PIC ZZZZZZZ9.99.  *> will remove zero value
01 NoZrPlusCommas PIC ZZ,ZZZ,ZZ9.99.
01 Dollar PIC $$,$$$,$$9.99.
01 BDay PIC 9(8) VALUE 12211974.
01 ADate PIC 99/99/9999.

PROCEDURE DIVISION.
MOVE StartNum TO NoZero
DISPLAY NoZero
MOVE StartNum TO NoZrPlusCommas
DISPLAY NoZrPlusCommas
MOVE StartNum TO Dollar
DISPLAY Dollar
MOVE BDay TO ADate  *> will move to the format
DISPLAY ADate


STOP RUN. 
